БПКР/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС12</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДСОсв</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/СтавкиНДС/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	
	Список.Добавить(Перечисления.СтавкиНДС.НДС12);
	Список.Добавить(Перечисления.СтавкиНДС.НДС0);
	Список.Добавить(Перечисления.СтавкиНДС.БезНДС);
	
	ДанныеВыбора = Список;
	
	// Розница КР
	//ИсключаемыеЗначения = Новый Массив;
	//
	//
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС18);
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС10);
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС20);
	//ИсключаемыеЗначения.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	//ДанныеВыбора = Новый СписокЗначений; // результат
	//
	//Запрос = Новый Запрос;
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	ЗначенияПеречисления.Ссылка КАК Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(ЗначенияПеречисления.Ссылка) КАК Представление
	//|ИЗ
	//|	Перечисление.%ИмяПеречисления% КАК ЗначенияПеречисления
	//|ГДЕ
	//|	НЕ ЗначенияПеречисления.Ссылка В (&ИсключаемыеЗначения)
	//|	//%ТекстОтборПоПараметрам%
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗначенияПеречисления.Порядок";
	//
	//Запрос.УстановитьПараметр("ИсключаемыеЗначения", ИсключаемыеЗначения);
	//
	//Если Параметры.Отбор.Свойство("Ссылка") Тогда
	//	
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ТекстОтборПоПараметрам%", "И ЗначенияПеречисления.Ссылка В (&ОтборПоСсылке)");
	//	
	//	Запрос.УстановитьПараметр("ОтборПоСсылке", Параметры.Отбор.Ссылка);
	//	
	//КонецЕсли;
	//
	//Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%ИмяПеречисления%", "СтавкиНДС");
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(Параметры.СтрокаПоиска)
	//	 ИЛИ СтрНайти(НРег(Выборка.Представление), НРег(Параметры.СтрокаПоиска)) = 1 Тогда
	//		ДанныеВыбора.Добавить(Выборка.Ссылка);
	//	КонецЕсли;
	//	
	//КонецЦикла;
КонецПроцедуры
